---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ViewSheetFailures.ViewInAModelMustBeUniqueWarn
source: html/b190c735-2aef-1f80-397b-f39844582943.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ViewSheetFailures.ViewInAModelMustBeUniqueWarn Property

Sheet views in this model cannot contain more than one instance of "%1!s!."

## Syntax (C#)
```csharp
public static FailureDefinitionId ViewInAModelMustBeUniqueWarn { get; }
```